infrastructure/jmeter/iot.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Orchestrator Load Test">
      <stringProp name="TestPlan.comments">Нагрузочный тест Orchestrator API</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="base_url" elementType="Argument">
            <stringProp name="Argument.name">base_url</stringProp>
            <stringProp name="Argument.value">http://localhost:8879</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GetDevices">
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <intProp name="ThreadGroup.num_threads">1200</intProp>
        <intProp name="ThreadGroup.ramp_time">450</intProp>
        <longProp name="ThreadGroup.duration">900</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="GetToken">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonSlurper
import org.apache.http.client.methods.HttpGet
import org.apache.http.impl.client.HttpClients
import org.apache.http.util.EntityUtils
import org.apache.http.entity.ContentType

try {
    // Конфигурация
    String authUrl = &quot;http://localhost:8887/auth/token&quot;
    String login = &quot;admin&quot;
    String password = &quot;admin&quot;
    
    // Логирование начала процесса
    log.info(&quot;Начинаем получение токена авторизации...&quot;)
    
    // Создаем HTTP клиент с таймаутами
    def httpClient = HttpClients.custom()
        .setConnectionTimeToLive(30, java.util.concurrent.TimeUnit.SECONDS)
        .build()
    
    // Формируем URL с параметрами
    def fullUrl = &quot;${authUrl}?login=${URLEncoder.encode(login, &quot;UTF-8&quot;)}&amp;password=${URLEncoder.encode(password, &quot;UTF-8&quot;)}&quot;
    def httpGet = new HttpGet(fullUrl)
    
    // Добавляем заголовки
    httpGet.setHeader(&quot;Accept&quot;, &quot;application/json&quot;)
    httpGet.setHeader(&quot;User-Agent&quot;, &quot;JMeter-Load-Test&quot;)
    
    // Выполняем запрос
    def response = httpClient.execute(httpGet)
    def statusCode = response.getStatusLine().getStatusCode()
    def responseBody = EntityUtils.toString(response.getEntity(), &quot;UTF-8&quot;)
    
    log.info(&quot;Статус ответа авторизации: ${statusCode}&quot;)
    
    if (statusCode == 200) {
        // Парсим JSON ответ
        def jsonSlurper = new JsonSlurper()
        def authResponse
        
        try {
            authResponse = jsonSlurper.parseText(responseBody)
        } catch (Exception e) {
            log.error(&quot;Ошибка парсинга JSON: ${e.getMessage()}&quot;)
            log.error(&quot;Ответ сервера: ${responseBody}&quot;)
            SampleResult.setSuccessful(false)
            SampleResult.setResponseMessage(&quot;Invalid JSON response&quot;)
            return
        }
        
        // Извлекаем токен
        String accessToken = authResponse.access_token
        
        if (accessToken &amp;&amp; !accessToken.isEmpty()) {
            // Сохраняем токен в переменную JMeter
            vars.put(&quot;access_token&quot;, accessToken)
            
            // Также сохраняем в props для использования в других потоках (опционально)
            props.put(&quot;access_token&quot;, accessToken)
            
            // Логируем успех (без полного токена в логах)
            log.info(&quot;✅ Токен успешно получен и сохранен в переменную &apos;access_token&apos;&quot;)
            log.info(&quot;   Длина токена: ${accessToken.length()} символов&quot;)
            log.info(&quot;   Первые 20 символов: ${accessToken.substring(0, Math.min(20, accessToken.length()))}...&quot;)
            
            // Сохраняем время получения токена для возможного кеширования
            vars.put(&quot;token_timestamp&quot;, System.currentTimeMillis().toString())
            
            // Можно также сохранить время истечения токена
            if (authResponse.expires_in) {
                vars.put(&quot;token_expires_in&quot;, authResponse.expires_in.toString())
                log.info(&quot;   Срок действия токена: ${authResponse.expires_in} секунд&quot;)
            }
            
        } else {
            log.error(&quot;❌ Токен не найден в ответе сервера&quot;)
            log.error(&quot;Полный ответ: ${responseBody}&quot;)
            SampleResult.setSuccessful(false)
            SampleResult.setResponseMessage(&quot;Token not found in response&quot;)
        }
        
    } else {
        log.error(&quot;❌ Ошибка при получении токена. HTTP статус: ${statusCode}&quot;)
        log.error(&quot;Тело ответа: ${responseBody}&quot;)
        SampleResult.setSuccessful(false)
        SampleResult.setResponseMessage(&quot;Failed to get token, status: ${statusCode}&quot;)
    }
    
    // Закрываем соединение
    EntityUtils.consume(response.getEntity())
    httpClient.close()
    
} catch (Exception e) {
    log.error(&quot;❌ Неожиданная ошибка при получении токена: &quot;, e)
    SampleResult.setSuccessful(false)
    SampleResult.setResponseMessage(&quot;Exception: &quot; + e.getMessage())
    
    // Выводим stack trace для отладки
    e.printStackTrace(new java.io.PrintWriter(log.getOutStream()))
}</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">deviceid.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">device_id</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${access_token}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer">
          <collectionProp name="load_profile">
            <collectionProp name="-1502215619">
              <stringProp name="48">0</stringProp>
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="51663">450</stringProp>
            </collectionProp>
            <collectionProp name="-1192673855">
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="51508">400</stringProp>
            </collectionProp>
            <collectionProp name="1672394923">
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="48625">100</stringProp>
              <stringProp name="1691">50</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Devices" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8879</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/devices</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>